# Module: Pandas Assignments
## Lesson: Pandas
### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.

In [89]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randint(1, 10, size=(4, 6)))
df.set_index(0)

   1  2  3  4  5
0
6  1  1  2  5  1
7  3  7  7  4  6
6  9  7  2  2  1
2  6  1  4  3  9

2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [90]:
df = pd.DataFrame(np.random.randint(1, 100, size=(3, 3)), columns=['A', 'B', 'C'], index=['X', 'Y', 'Z'])
print(df)
df.loc['Y']['B']

    A   B   C
X  60  63  53
Y  93  37  45
Z  24  72  34

np.int32(37)

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.

In [91]:
df = pd.DataFrame(np.random.randint(1, 10, size=(5, 3)))
print(df)

df[3] = df[0] + df[1]
df

   0  1  2
0  3  6  1
1  2  7  6
2  1  5  4
3  7  4  2
4  9  6  1

   0  1  2   3
0  3  6  1   9
1  2  7  6   9
2  1  5  4   6
3  7  4  2  11
4  9  6  1  15

2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [92]:
df = pd.DataFrame(np.random.randint(1, 10, size=(4, 3)))
print(df)

print(f"Row-wise sum:\n{df.sum(axis = 1)}")
print(f"Column-wise sum:\n{df.sum(axis = 0)}")

   0  1  2
0  4  9  6
1  6  5  9
2  1  5  4
3  5  4  6
Row-wise sum:
0    19
1    20
2    10
3    15
dtype: int64
Column-wise sum:
0    16
1    23
2    25
dtype: int64

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.

In [93]:
df = pd.DataFrame({'col1': [1, 2, 3, np.nan, 5], 'col2': [np.nan, 5, 6, 7, 9], 'col3': [3, 2, 3, 5, np.nan]})
print(df)
df.fillna(df.mean(), inplace=True)
print(df)

   col1  col2  col3
0   1.0   NaN   3.0
1   2.0   5.0   2.0
2   3.0   6.0   3.0
3   NaN   7.0   5.0
4   5.0   9.0   NaN
   col1  col2  col3
0  1.00  6.75  3.00
1  2.00  5.00  2.00
2  3.00  6.00  3.00
3  2.75  7.00  5.00
4  5.00  9.00  3.25

2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [94]:
df = pd.DataFrame(np.random.randint(1, 10, size=(6, 4)))
df.loc[0, 1] = np.nan
print(df)
new_df = df.dropna()
print(new_df)

   0    1  2  3
0  9  NaN  7  5
1  1  6.0  6  8
2  1  6.0  5  1
3  9  7.0  8  6
4  3  5.0  1  8
5  4  1.0  1  5
   0    1  2  3
1  1  6.0  6  8
2  1  6.0  5  1
3  9  7.0  8  6
4  3  5.0  1  8
5  4  1.0  1  5

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.

In [95]:
categories = np.random.choice(['A', 'B', 'C'], size=15)
values = np.random.randint(1, 10, size=(15))

data = {
    'Category': categories,
    'Value': values
}

df = pd.DataFrame(data)
print(df)

df.groupby('Category')['Value'].sum()

   Category  Value
0         C      2
1         B      6
2         C      4
3         C      7
4         B      4
5         B      2
6         B      4
7         B      3
8         B      1
9         A      1
10        B      8
11        C      3
12        A      6
13        C      3
14        C      2

Category
A     7
B    28
C    21
Name: Value, dtype: int32

2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [96]:
categories = np.random.choice(['A', 'B', 'C'], size=15)
products = np.random.choice(['Phone', 'Magazine', 'Radio'], size=15)
sales = np.random.randint(10, 20, size=15)

data = {
    'Product': products,
    'Category': categories,
    'Sale': sales
}

df = pd.DataFrame(data)
print(df)

df.groupby('Category')['Sale'].sum()

     Product Category  Sale
0   Magazine        A    16
1      Radio        B    15
2      Phone        A    13
3      Phone        B    14
4   Magazine        B    12
5      Phone        A    18
6      Phone        A    10
7      Phone        B    10
8   Magazine        C    18
9   Magazine        A    18
10     Radio        C    16
11     Radio        B    10
12  Magazine        B    16
13     Radio        B    15
14     Radio        C    15

Category
A    75
B    92
C    49
Name: Sale, dtype: int32

### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.

In [97]:
math = pd.DataFrame({'Name': ['Ram', 'John', 'Derek'], 'Math': [80, 85, 75]})
science = pd.DataFrame({'Name': ['Ram', 'John', 'Derek'], 'Science': [80, 66, 23]})

merged_df = math.merge(science, on='Name')
merged_df

    Name  Math  Science
0    Ram    80       80
1   John    85       66
2  Derek    75       23

2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

In [101]:
math = pd.DataFrame({'Name': ['Ram', 'John', 'Derek'], 'Math': [80, 85, 75]})
science = pd.DataFrame({'Last Name': ['Ram', 'John', 'Derek'], 'Science': [80, 66, 23]})

row_wise_concat = pd.concat([math, science], axis = 0)
print(row_wise_concat)

column_wise_concat = pd.concat([math, science], axis = 1)
print(column_wise_concat)

    Name  Math Last Name  Science
0    Ram  80.0       NaN      NaN
1   John  85.0       NaN      NaN
2  Derek  75.0       NaN      NaN
0    NaN   NaN       Ram     80.0
1    NaN   NaN      John     66.0
2    NaN   NaN     Derek     23.0
    Name  Math Last Name  Science
0    Ram    80       Ram       80
1   John    85      John       66
2  Derek    75     Derek       23

### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.

In [102]:
date_range = pd.date_range(start='2025-01-01', end='2025-03-31', freq='D')

df = pd.DataFrame(date_range, columns=['date'])

df['data'] = np.random.randint(1, 100, size=len(date_range))
df.set_index('date', inplace=True)

monthly_mean = df.resample('ME').mean()
print(monthly_mean)

                 data
date
2025-01-31  60.774194
2025-02-28  43.392857
2025-03-31  43.322581

2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

In [3]:

import pandas as pd
import numpy as np
date_range = pd.date_range(start="2021-01-01", end="2021-12-31", freq="D")

df = pd.DataFrame(date_range, columns=['date'])

df['data'] = np.random.randint(1, 100, size=len(date_range))
df.set_index('date', inplace=True)
print(df)

print(df.rolling(window=7).mean())

            data
date
2021-01-01    25
2021-01-02    57
2021-01-03    34
2021-01-04     7
2021-01-05    22
...          ...
2021-12-27    34
2021-12-28    28
2021-12-29    72
2021-12-30     9
2021-12-31     6

[365 rows x 1 columns]
                 data
date
2021-01-01        NaN
2021-01-02        NaN
2021-01-03        NaN
2021-01-04        NaN
2021-01-05        NaN
...               ...
2021-12-27  54.142857
2021-12-28  56.285714
2021-12-29  52.857143
2021-12-30  50.142857
2021-12-31  40.000000

[365 rows x 1 columns]

### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.

In [14]:
array = [['Phone', 'Phone', 'TV', 'TV'], [12000, 10000, 15000, 7500]]
index = pd.MultiIndex.from_arrays(array, names=('Product', 'Price'))
df = pd.DataFrame(np.random.randint(1, 100, size=(4, 3)), index=index, columns=['Value1', 'Value2', 'Value3'])

print(df)
print()
print(df.loc['Phone'])
print()
print(df.loc[('Phone', 12000)])

               Value1  Value2  Value3
Product Price
Phone   12000      33      52      88
        10000      44      30      58
TV      15000      60      82      58
        7500       53      22      21

       Value1  Value2  Value3
Price
12000      33      52      88
10000      44      30      58

Value1    33
Value2    52
Value3    88
Name: (Phone, 12000), dtype: int32

2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

In [31]:
array = [['Phone', 'Phone', 'TV', 'TV', 'Phone'], ['Brick', 'Smart', 'LCD', 'LED', 'Brick']]

index = pd.MultiIndex.from_arrays(array, names=['Category', 'SubCategory'])

df = pd.DataFrame(np.random.randint(1, 100, size=(5, 3)), index=index, columns=['Price 1', 'Price 2', 'Price 3'])

print(df)

sum_values = df.groupby(['Category']).sum()
print(sum_values)

category_sum = df.groupby(['Category', 'SubCategory']).sum()
print(category_sum)

                      Price 1  Price 2  Price 3
Category SubCategory
Phone    Brick              1        6       65
         Smart             71       87       98
TV       LCD               88       64        6
         LED               93       41       88
Phone    Brick             16       88        7
          Price 1  Price 2  Price 3
Category
Phone          88      181      170
TV            181      105       94
                      Price 1  Price 2  Price 3
Category SubCategory
Phone    Brick             17       94       72
         Smart             71       87       98
TV       LCD               88       64        6
         LED               93       41       88

### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.

In [38]:
date_range = pd.date_range(start="2025-01-01", end="2025-01-30", freq="D")
categories = np.random.choice(['Electronics', 'Clothes'], size=30)
values = np.random.randint(10, 100, size=30)

data = {
    'Date': date_range,
    'Category': categories,
    'Value': values
}
df = pd.DataFrame(data)

pivot_table = df.pivot_table(values='Value', index='Date', columns='Category', aggfunc='sum')
pivot_table

Category    Clothes  Electronics
Date
2025-01-01      NaN         90.0
2025-01-02      NaN         39.0
2025-01-03      NaN         98.0
2025-01-04      NaN         63.0
2025-01-05      NaN         87.0
2025-01-06      NaN         15.0
2025-01-07     55.0          NaN
2025-01-08     85.0          NaN
2025-01-09     66.0          NaN
2025-01-10      NaN         99.0
2025-01-11     91.0          NaN
2025-01-12     97.0          NaN
2025-01-13      NaN         27.0
2025-01-14      NaN         71.0
2025-01-15     59.0          NaN
2025-01-16     15.0          NaN
2025-01-17      NaN         21.0
2025-01-18      NaN         18.0
2025-01-19      NaN         62.0
2025-01-20      NaN         74.0
2025-01-21      NaN         84.0
2025-01-22      NaN         77.0
2025-01-23      NaN         27.0
2025-01-24      NaN         51.0
2025-01-25      NaN         29.0
2025-01-26     42.0          NaN
2025-01-27      NaN         39.0
2025-01-28      NaN         88.0
2025-01-29     13.0          NaN
2025-01-30      NaN         35.0

2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

In [51]:
years = np.arange(2000, 2025)            # Years from 2000 to 2024
year_quarters = np.repeat(years, 4) 
quarter = np.tile(['Q1', 'Q2', 'Q3', 'Q4'], 25)
revenue = np.random.randint(10, 100, size=100)

data = {
    'Year': year_quarters,
    'Quarter': quarter,
    'Revenue': revenue
}

df = pd.DataFrame(data)

pivoted_table = df.pivot_table(values='Revenue', columns='Quarter', index='Year', aggfunc='mean')

pivoted_table

Quarter    Q1    Q2    Q3    Q4
Year
2000     92.0  90.0  61.0  53.0
2001     18.0  83.0  23.0  52.0
2002     96.0  25.0  34.0  29.0
2003     45.0  36.0  63.0  60.0
2004     75.0  31.0  69.0  59.0
2005     98.0  70.0  96.0  34.0
2006     27.0  41.0  43.0  58.0
2007     47.0  90.0  53.0  10.0
2008     15.0  30.0  93.0  68.0
2009     35.0  99.0  16.0  98.0
2010     38.0  31.0  58.0  34.0
2011     47.0  27.0  71.0  16.0
2012     76.0  56.0  98.0  63.0
2013     43.0  12.0  91.0  97.0
2014     32.0  54.0  52.0  86.0
2015     83.0  58.0  95.0  27.0
2016     24.0  25.0  95.0  17.0
2017     66.0  13.0  60.0  35.0
2018     25.0  35.0  46.0  61.0
2019     94.0  64.0  31.0  99.0
2020     49.0  68.0  11.0  12.0
2021     87.0  21.0  65.0  92.0
2022     17.0  30.0  88.0  18.0
2023     32.0  16.0  68.0  71.0
2024     78.0  65.0  28.0  28.0

### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.

In [54]:
df= pd.DataFrame(np.random.randint(1, 10, size=(5, 3)))
print(df)

double_df = df.apply(lambda x: x * 2)
print(double_df)

   0  1  2
0  5  2  2
1  6  9  5
2  4  3  1
3  8  5  2
4  3  7  6
    0   1   2
0  10   4   4
1  12  18  10
2   8   6   2
3  16  10   4
4   6  14  12

2. Create a Pandas DataFrame with 3 columns and 6 rows filled with random integers. Apply a lambda function to create a new column that is the sum of the existing columns.

In [62]:
df = pd.DataFrame(np.random.randint(1, 10, size=(6, 3)))

df['total'] = df.apply(lambda row: row[0] + row[1] + row[2], axis = 1)
df

   0  1  2  total
0  8  2  6     16
1  7  2  6     15
2  3  7  1     11
3  3  7  8     18
4  1  8  9     18
5  7  8  4     19

### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.

In [65]:
ps = pd.Series(np.random.choice(['Apple', 'Ball', 'Cat', 'Dog', 'Egg', 'Fish'], size=5))
upper_ps = ps.apply(lambda string: string.upper())
upper_ps

0    APPLE
1    APPLE
2     BALL
3      DOG
4    APPLE
dtype: object

2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

In [67]:
ps = pd.Series(np.random.choice(['Apple', 'Ball', 'Cat', 'Dog', 'Egg', 'Fish'], size=5))

extracted_ps = ps.apply(lambda x: x[:3])
extracted_ps

0    Egg
1    Bal
2    App
3    Egg
4    Egg
dtype: object